{
    "staff": [
        {
            "name": "Ranjani",
            "bio": "CS major and minoring in Econometrics. My main interests lie in MedTech and Bioinformatics!  I love dogs, music and fashion. ",
            "picture": "Ranjani"
        },
        {
            "name": "Smriti",
            "bio": "Hi, I'm Smriti and I'm a junior in CS. I'm excited to see what you all are going to work on this year!",
            "picture": "Smriti"
        },
        {
            "name": "Aaron",
            "bio": "I'm a sophomore majoring in computer science. I'm most proficient in web development and related technologies like Node.js, ReactJS, Firebase, and other frameworks. I'm familiar with several programming languages including Java, JavaScript, Python, C++, and a bit of Kotlin.",
            "picture": "Aaron"
        },
        {
            "name": "Bill",
            "bio": "As an A.I. Language Model...",
            "picture": "Bill"
        },
        {
            "name": "Keshat",
            "bio": "Hello there! I am a Junior in Mechanical Engineering pursuing minors in CS and Business. I love to play badminton and watch movies and sitcoms. Looking forward to getting to know y’all!",
            "picture": "Keshat"
        },
        {
            "name": "Davis",
            "bio": "I'm a senior studying Computer Science! I also do research in machine learning and wireless sensing.",
            "picture": "Davis"
        },
        {
            "name": "Shagun",
            "bio": "Hi! I am a Computer Science major who loves an overpriced pumpkin coffee, a good read, and dance.",
            "picture": "Shagun"
        },
        {
            "name": "Jack",
            "bio": "I often sleep, occasionally code",
            "picture": "Jack"
        },
        {
            "name": "Roma",
            "bio": "Hi! My name is Roma and I'm a junior majoring in Mathematics & Computer Science and minoring in business. I love cooking, going to the gym, and reading. I also love exploring new cafes/study spots around campus :) super excited to be a PM for 124H this year and to meet everyone!",
            "picture": "Roma"
        },
        {
            "name": "Naina",
            "bio": "Hi! I'm Naina, a sophomore majoring in Computer Science and Statistics, with a strong interest in the intersection of CS and Finance. This fall will be my second semester as a Project Manager for CS 124 Honors. I'm excited to meet everyone and collaborate on new ideas!",
            "picture": "Naina"
        },
        {
            "name": "Somya",
            "bio": "I am a sophomore in Computer Science. I have experience with Pygame, Backend  Development (Node.JS and Express.JS) and Blockchain. I like to sketch in my free time.",
            "picture": "Somya"
        },
        {
            "name": "Prisha",
            "bio": "Hi! I'm Prisha, and I am a sophomore studying Computer Science and Mathematics. On campus, I'm involved in WCS, D-Lab, and STAT 107 (CA). Aside from CS & Math, I love biking, playing pickleball, and dancing. I'm excited to be a CS 124H PM this semester! ",
            "picture": "Prisha"
        },
        {
            "name": "Dhanish",
            "bio": "Computer Science & Statistics Major who loves music, biking, and building cool things!",
            "picture": "Dhanish"
        },
        {
            "name": "Palak",
            "bio": "Majoring in CS, minoring in business! Love to play soccer, hike, and eat yum foods!",
            "picture": "Palak"
        },
        {
            "name": "Pritika",
            "bio": "CS major who has an unhealthy obsession with cats :P ",
            "picture": "Pritika"
        }
    ]
  }